rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_MC_CGM.h
/*! @name MUX_15_CSS - Clock Mux 15 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_15_CSS_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_15_CSS_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_15_CSS_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_15_CSS_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_CSS_CLK_SW_SHIFT)) & MC_CGM_MUX_15_CSS_CLK_SW_MASK)

#define MC_CGM_MUX_15_CSS_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_15_CSS_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_15_CSS_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_15_CSS_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_CSS_SAFE_SW_SHIFT)) & MC_CGM_MUX_15_CSS_SAFE_SW_MASK)

#define MC_CGM_MUX_15_CSS_SWIP_MASK              (0x10000U)
#define MC_CGM_MUX_15_CSS_SWIP_SHIFT             (16U)
#define MC_CGM_MUX_15_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_MUX_15_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_CSS_SWIP_SHIFT)) & MC_CGM_MUX_15_CSS_SWIP_MASK)

#define MC_CGM_MUX_15_CSS_SWTRG_MASK             (0xE0000U)
#define MC_CGM_MUX_15_CSS_SWTRG_SHIFT            (17U)
#define MC_CGM_MUX_15_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_MUX_15_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_CSS_SWTRG_SHIFT)) & MC_CGM_MUX_15_CSS_SWTRG_MASK)

#define MC_CGM_MUX_15_CSS_SELSTAT_MASK           (0x1F000000U)
#define MC_CGM_MUX_15_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_15_CSS_SELSTAT_WIDTH          (5U)
#define MC_CGM_MUX_15_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_15_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_15_DC_0 - Clock Mux 15 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_15_DC_0_DIV_MASK              (0x3F0000U)
#define MC_CGM_MUX_15_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_15_DC_0_DIV_WIDTH             (6U)
#define MC_CGM_MUX_15_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_DC_0_DIV_SHIFT)) & MC_CGM_MUX_15_DC_0_DIV_MASK)

#define MC_CGM_MUX_15_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_MUX_15_DC_0_DE_SHIFT              (31U)
#define MC_CGM_MUX_15_DC_0_DE_WIDTH              (1U)
#define MC_CGM_MUX_15_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_DC_0_DE_SHIFT)) & MC_CGM_MUX_15_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_15_DIV_UPD_STAT - Clock Mux 15 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_15_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_16_CSC - Clock Mux 16 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_16_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_16_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_16_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_16_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSC_CLK_SW_SHIFT)) & MC_CGM_MUX_16_CSC_CLK_SW_MASK)

#define MC_CGM_MUX_16_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_16_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_16_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_16_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSC_SAFE_SW_SHIFT)) & MC_CGM_MUX_16_CSC_SAFE_SW_MASK)

#define MC_CGM_MUX_16_CSC_SELCTL_MASK            (0x1F000000U)
#define MC_CGM_MUX_16_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_MUX_16_CSC_SELCTL_WIDTH           (5U)
#define MC_CGM_MUX_16_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_16_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_16_CSS - Clock Mux 16 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_16_CSS_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_16_CSS_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_16_CSS_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_16_CSS_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSS_CLK_SW_SHIFT)) & MC_CGM_MUX_16_CSS_CLK_SW_MASK)

#define MC_CGM_MUX_16_CSS_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_16_CSS_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_16_CSS_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_16_CSS_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSS_SAFE_SW_SHIFT)) & MC_CGM_MUX_16_CSS_SAFE_SW_MASK)

#define MC_CGM_MUX_16_CSS_SWIP_MASK              (0x10000U)
#define MC_CGM_MUX_16_CSS_SWIP_SHIFT             (16U)
#define MC_CGM_MUX_16_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_MUX_16_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSS_SWIP_SHIFT)) & MC_CGM_MUX_16_CSS_SWIP_MASK)

#define MC_CGM_MUX_16_CSS_SWTRG_MASK             (0xE0000U)
#define MC_CGM_MUX_16_CSS_SWTRG_SHIFT            (17U)
#define MC_CGM_MUX_16_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_MUX_16_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSS_SWTRG_SHIFT)) & MC_CGM_MUX_16_CSS_SWTRG_MASK)

#define MC_CGM_MUX_16_CSS_SELSTAT_MASK           (0x1F000000U)
#define MC_CGM_MUX_16_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_16_CSS_SELSTAT_WIDTH          (5U)
#define MC_CGM_MUX_16_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_16_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_16_DC_0 - Clock Mux 16 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_16_DC_0_DIV_MASK              (0x3F0000U)
#define MC_CGM_MUX_16_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_16_DC_0_DIV_WIDTH             (6U)
#define MC_CGM_MUX_16_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_DC_0_DIV_SHIFT)) & MC_CGM_MUX_16_DC_0_DIV_MASK)

#define MC_CGM_MUX_16_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_MUX_16_DC_0_DE_SHIFT              (31U)
#define MC_CGM_MUX_16_DC_0_DE_WIDTH              (1U)
#define MC_CGM_MUX_16_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_DC_0_DE_SHIFT)) & MC_CGM_MUX_16_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_16_DIV_UPD_STAT - Clock Mux 16 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_16_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_18_CSC - Clock Mux 18 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_18_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_18_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_18_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_18_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSC_CLK_SW_SHIFT)) & MC_CGM_MUX_18_CSC_CLK_SW_MASK)

#define MC_CGM_MUX_18_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_18_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_18_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_18_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSC_SAFE_SW_SHIFT)) & MC_CGM_MUX_18_CSC_SAFE_SW_MASK)

#define MC_CGM_MUX_18_CSC_SELCTL_MASK            (0x1F000000U)
#define MC_CGM_MUX_18_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_MUX_18_CSC_SELCTL_WIDTH           (5U)
#define MC_CGM_MUX_18_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_18_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_18_CSS - Clock Mux 18 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_18_CSS_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_18_CSS_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_18_CSS_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_18_CSS_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSS_CLK_SW_SHIFT)) & MC_CGM_MUX_18_CSS_CLK_SW_MASK)

#define MC_CGM_MUX_18_CSS_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_18_CSS_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_18_CSS_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_18_CSS_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSS_SAFE_SW_SHIFT)) & MC_CGM_MUX_18_CSS_SAFE_SW_MASK)

#define MC_CGM_MUX_18_CSS_SWIP_MASK              (0x10000U)
#define MC_CGM_MUX_18_CSS_SWIP_SHIFT             (16U)
#define MC_CGM_MUX_18_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_MUX_18_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSS_SWIP_SHIFT)) & MC_CGM_MUX_18_CSS_SWIP_MASK)

#define MC_CGM_MUX_18_CSS_SWTRG_MASK             (0xE0000U)
#define MC_CGM_MUX_18_CSS_SWTRG_SHIFT            (17U)
#define MC_CGM_MUX_18_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_MUX_18_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSS_SWTRG_SHIFT)) & MC_CGM_MUX_18_CSS_SWTRG_MASK)

#define MC_CGM_MUX_18_CSS_SELSTAT_MASK           (0x1F000000U)
#define MC_CGM_MUX_18_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_18_CSS_SELSTAT_WIDTH          (5U)
#define MC_CGM_MUX_18_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_18_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_18_DC_0 - Clock Mux 18 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_18_DC_0_DIV_MASK              (0x10000U)
#define MC_CGM_MUX_18_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_18_DC_0_DIV_WIDTH             (1U)
#define MC_CGM_MUX_18_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_DC_0_DIV_SHIFT)) & MC_CGM_MUX_18_DC_0_DIV_MASK)

#define MC_CGM_MUX_18_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_MUX_18_DC_0_DE_SHIFT              (31U)
#define MC_CGM_MUX_18_DC_0_DE_WIDTH              (1U)
#define MC_CGM_MUX_18_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_18_DC_0_DE_SHIFT)) & MC_CGM_MUX_18_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_18_DIV_UPD_STAT - Clock Mux 18 Divider Update Status Register */
/*! @{ */

